esb-sms-service/data-xml-base/esb-sms.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:fcub="http://fcubs.ofss.com/service/FCUBSExternalService">
    <soapenv:Header/>
    <soapenv:Body>
        <fcub:EXTERNALSERVICE_REQ>
            <FCUBS_HEADER>
                <SOURCE/>
                <UBSCOMP/>
                <REFERENCE_NO/>
                <MSGID>%s</MSGID>
                <CORRELID/>
                <USERID>ESB_GATEWAY</USERID>
                <BRANCH/>
                <MODULEID/>
                <SERVICE>SMS_FPT</SERVICE>
                <OPERATION>SMS_OTP</OPERATION>
                <SOURCE_OPERATION/>
                <SOURCE_USERID/>
                <DESTINATION>%s</DESTINATION>
                <MULTITRIPID/>
                <FUNCTIONID/>
                <ACTION/>
                <PASSWORD>
                    lMjZ30djFY9F5Ut9EkkOsKLDyfVLmZfQe0kNxZCT5ScLEDNuoeHVWm7t0Bm1iLudqAYwLZXyUlnZFJDefp500MghJzXd/edBV0PC/AYy0iR388oR8NNLzJDMl2Xpi1W5VkR4X04YiiareCdzm99neKJHtsBsFS5rTAshqhxMcPc=
                </PASSWORD>
            </FCUBS_HEADER>
            <FCUBS_BODY>
                <SERVICE_IO>
                    <SERVICE_ID>%s</SERVICE_ID>
                    <PRODUCT_CODE>%s</PRODUCT_CODE>
                </SERVICE_IO>
                <SEND_INFO_IO>
                    <MOBILE_NUMBER>%s</MOBILE_NUMBER>
                    <CONTENT>%s</CONTENT>
                    <SERVICE_LOG>%s</SERVICE_LOG>
                    <CATEGORY>%s</CATEGORY>
                </SEND_INFO_IO>
            </FCUBS_BODY>
        </fcub:EXTERNALSERVICE_REQ>
    </soapenv:Body>
</soapenv:Envelope>
